package com.example.autismtheme;

import android.app.Activity;
import android.os.Bundle;
import android.widget.ExpandableListView;

import java.util.ArrayList;

public class AboutAutismActivity extends Activity{

	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setContentView(R.layout.autism_page);
		ExpandableListView expListView = (ExpandableListView) findViewById(R.id.expandable_list_view);
		// preparing list data
		ArrayList<ItemAboutAutism> items = prepareListData();
		AdapterAboutAutism listAdapter = new AdapterAboutAutism(this,items);
		// setting list adapter
		expListView.setAdapter(listAdapter);
	}

	private ArrayList<ItemAboutAutism> prepareListData(){
		ArrayList<ItemAboutAutism> items = new ArrayList<>();
		items.add(new ItemAboutAutism("طیف اختلالات اتیستیک چیست؟",
				"\"طیف اختلالات اتیستیک\" به گروهی از اختلالات اطلاق " +
						"می\u00ADشود که وجه مشخصه آنها تاخیر یا انحرا" +
						"ف در رشد مهارت\u200Cهای اجتماعی، شناختی، ارتباط" +
						" کلامی و غیرکلامی است. کودکان مبتلا به اختلال اتی" +
						"سم اغلب علاقه شدید و خاصی نسبت به برخی فعالیت\u200Cه" +
						"ا دارند، در مقابل تغییرات مقاومند و حساسیت و پاسخ\u00AD" +
						"دهی مناسبی نسبت به محرک\u00ADهای اجتماعی یا فیزیکی از خود" +
						" نشان نمی\u200Cدهند. "));
		items.add(new ItemAboutAutism("اتیسم چیست؟","اتیسم یک اختلال عصب\u00ADشناختی با علائم اختلالات رفتاری است. این اختلال، روند اکتساب و اجرای اعمال و فعالیت\u00ADهای کودک را مختل می\u00ADکند.\n" +
				"مهمترین ویژگی\u00ADهای این اختلال عبارتند از: فقدان یا کمبود روابط اجتماعی، بی\u00ADتوجهی نسبت به محرک\u200Cهای محیطی نظیر نامیدن اسم او، فقدان تماس چشمی، تمایل به تنهایی، فقدان گفتار یا داشتن کلام بدون قصد ارتباط، گفتار تکراری و تقلید طوطی\u00ADوار،  فقدان بازی\u00ADهای تخیلی و اجتماعی، نارسایی جدی در فهم هیجانات دیگران یا بیان عواطف و هیجانات خود، علایق محدود (مثلاً فقط غذا\u00ADهای خاصی را به سبک مشخصی می\u00ADخورد یا علاقه\u00ADی مفرطی به اشیای خاصی دارد)، رفتارهای کلیشه\u00ADای و حرکات تکراری (مثل بال\u00ADبال زدن یا تکان دادن انگشتان جلوی چشم\u00ADها)، تمایل وسواس\u00ADگونه به حفظ ثبات و یکنواختی در محیط یا در اعمال روزمره، حساسیت بیش از حد و یا کمتر از حد معمول به محرک\u00ADها، خنده و یا گریه\u00ADهای نابجا، ناپختگی در مهارت\u00ADهای ظریف یا درشت \u00ADحرکتی، بیش فعالی یا کم فعالی، خیره ماندن به دست\u00ADها یا اجزای اشیا، قشقرق\u00ADهای شدید، ضربه به سر  و صورت خود یا دیگران.\n" +
				"البته ممکن است برخی از علایم در بعضی از  کودکان مشاهده نشوند. همچنین معمولاً علایم در طول رشد تغییر می\u00ADکنند."));
		items.add(new ItemAboutAutism("علایم هشدار دهنده اتیسم در سنین مختلف","علائم در اولین سال زندگی: فقدان لبخند به مادر، بیان چهره\u00ADای نامناسب، کمبود توجه و تبادلات اجتماعی (نظیر بی تفاوتی نسبت به حضور والدین کنار بالین و فقدان واکنش\u00ADهای هیجانی یا جسمی برای در آغوش گرفته شدن)، تمايل به تنهایی، فقدان تماس چشمی و بیان هیجانی، اشاره کمتر به اشیا، حس کنجکاوی ناچیز، بسیار آرام یا فوق العاده ناآرام، ترس\u00ADهای عجیب و غیر قابل توضیح (مثلاً با دیدن یک گلدان شروع به گریه کرده و این کار را مادامی که گلدان پیش رویش است ادامه می\u200Cدهد).\n" +
				"علائم در سنین 2 تا 5 سالگی: علائم اصلی این اختلال که پیشتر به آن اشاره شد در همین سنین  ظاهر می\u00ADشود. بدین صورت که یا اختلال تدریجاً شدت گرفته و مورد توجه والدین و متخصصین قرار می\u200Cگیرد. یا این\u00ADکه کودک پس از رشد طبیعی ناگهان سیر وا\u200Cپس\u200Cروی آغاز می\u200Cکند و علائم پیش گفته ظاهر می\u200Cشود.\n" +
				"علايم در سنین اواخر دوران کودکی (سنین مدرسه): علائم زیر باید هشداری برای والدین و معلمین محسوب گردد: اختلالات ارتباطی و ناهنجاری\u00ADهای رشدی مانند تلفظ عجیب و غریب، اشاره به خود با ضمایر سوم شخص، استفاده از لغات غیر معمول و استفاده محدود از زبان برای ارتباط و همچنین اختلالات اجتماعی مانند ناتوانی در بازی با سایر بچه\u00ADها، عدم توجه به هنجارهای کلاس درس، عدم انعطاف و واکنش نسبت به هرگونه تغییر، عادت و تمایلات عجیب نظیر حمل اشیای خاص با خود، شکست در برقراری ارتباط طبیعی با بزرگسالان. عدم درک دیدگاه و نظر دیگران وپافشاری مفرط برخواست یا نظر خود"));
		items.add(new ItemAboutAutism("علائم مهم برای ارجاع کودک به متخصص","1.       عدم وجود غان و غون و تبادلات هیجانی یا اجتماعی  تا 12 ماهگی\n" +
				"2.        عدم وجود تک کلمه در 18 ماهگی\n" +
				"3.       فقدان عبارات دو کلمه\u00ADای برای ایجاد ارتباط در 24 ماهگی\n" +
				"4.       هر نوع پس رفت در زبان یا مهارت\u00ADهای اجتماعی در هر سنی\n" +
				"5.       کمبود یا فقدان تماس چشمی\n" +
				"6.       تمايل به تنهايي\n" +
				"7.       آواها، کلمات يا حرکات کلیشه\u00ADای و تکراری"));
		items.add(new ItemAboutAutism(" سن شروع اتیسم ","در اکثر موارد علائم این بیماری از تولد تا 36 ماهگی ظاهر می\u00ADشود. اما ممکن است با توجه به میزان آگاهی والدین و شدت بیماری، اين اختلال تا مدتها بعد تشخیص داده نشود."));
		items.add(new ItemAboutAutism("میزان شیوع اتیسم","در سال\u00ADهای اخیر تعداد کودکانی که تشخیص اختلال اتیسم می\u00ADگیرند به شدت رو به افزایش است.این موضوع می\u00ADتواندبه دلایل گوناگونی از جمله دقیق\u00ADتر شدن روش \u00ADهای تشخیص یا افزایش عوامل ایجاد اختلال اتیسم باشد. به هر حال، میزان شیوع این اختلال دست\u00ADکم، 5 تا 6 مورد در هر هزار کودک برآورد شده است.وقوع این اختلال در پسرها 3 تا 5 برابر دخترها است."));
		items.add(new ItemAboutAutism("علت شناسی اختلال اتیسم"," علت این اختلال هنوز مشخص نیست. اما در فهرست علل این بیماری، اختلالات دوران جنینی مانند ابتلای مادر به سرخچه، اختلالات متابولیکی، عفونت\u00ADهای پس از زایمان، واكسيناسيون، آلودگی\u00ADهای محیط زیست، مسمومیت با فلزات سنگین و عوامل ژنتیک آمده است."));
		items.add(new ItemAboutAutism("رابطه اتیسم و سطوح اجتماعی","این اختلال در تمام دنیا، در هر نژاد، قومیت و زمینه\u00ADی اجتماعی و اقتصادی مشاهده می\u200Cشود. ولی به\u200Cنظر میرسد که تنوع آن در طبقات بالاتر و تحصیل کرده بیشتر باشد."));
		items.add(new ItemAboutAutism("روش\u00ADهای درمانی","مثل بسیاری از بیماری\u00ADهای دیگر، اختلال اتیسم درمان قطعی ندارد. ولی با اقدامات توانبخشی زودهنگام، می\u200Cتوان از شدت علایم کاست و احتمال زندگی عادی در کودک را افزایش  داد. برخی از مهمترین روش\u00ADهای درمانی عبارتند از:\n" +
				"1.     درمان\u00ADهای روان\u00ADشناختی مانند: رفتاردرمانی یا \"تحليل رفتار کاربردی (ABA)\"، آموزش با \"سیستم تبادل \u00ADتصویری (PECS)\"، آموزش والدین با \"بسته\u00AD پرنده کوچولو\"، روان درمانی خانواده و کودک، نوپروری روابط کودک با والدین و به ویژه با مادر.\n" +
				"2.        دارو درمانی و ویتامین درمانی\n" +
				"3.       گفتار درمانی\n" +
				"4.        کاردرمانی\n" +
				"5.       تغذیه درمانی\n" +
				"6.       آموزش یکپارچگی حسی."));
		items.add(new ItemAboutAutism("منبع","برگرفته از وب\u00ADسایت ctad.ir"));
		return  items;
	}

}
